# Указываем базовый образ с установленным Go
FROM golang:1.22.0 AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для установки зависимостей
COPY go.mod go.sum ./

# Устанавливаем зависимости
RUN go mod download

# Копируем остальные файлы проекта
COPY . .

# Собираем бинарный файл
RUN go build -o main .

# Используем минимальный базовый образ для финального контейнера
FROM debian:bookworm-slim

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем бинарный файл из стадии сборки
COPY --from=builder /app/main .

# Указываем, какой порт будет открыт
EXPOSE 8080

# Запускаем приложение
CMD ["./main"]

